
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.ec2.tls_private_key.main: Refreshing state... [id=5a7970533ed394acda9ee9b4635965c0bafa34f6]
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_branch_protection.devops_challenge: Refreshing state... [id=BPR_kwDONzXdBs4DiCuz]
module.ec2.aws_key_pair.main: Refreshing state... [id=server-key]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-01a2a4df085287311]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.s3.aws_s3_bucket.server_ssh_keys_bucket: Refreshing state... [id=devops-challenge-teamsoft-ssh-keys-bucket]
module.s3.aws_s3_bucket_versioning.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.ec2.aws_s3_object.ssh_private_key: Refreshing state... [id=ssh-keys/server-key.pem]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0c2cb008c88e6cb17]
module.vpc.aws_subnet.main_public: Refreshing state... [id=subnet-07545b1673838832f]
module.vpc.aws_route_table.main_public: Refreshing state... [id=rtb-0996922b3d691f532]
module.vpc.aws_security_group.main: Refreshing state... [id=sg-02a0a6a3f1dd78a9b]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.git.github_actions_secret.devops_challenge_runner_github_token: Refreshing state... [id=devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN]
module.git.github_actions_secret.devops_challenge_git_auth_token: Refreshing state... [id=devops-challenge-teamsoft:GIT_AUTH_TOKEN]
module.git.github_actions_secret.devops_challenge_thandi_cidr_ipv4: Refreshing state... [id=devops-challenge-teamsoft:THANDI_CIDR_IPV4]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]
module.vpc.aws_route.main_public_internet_access: Refreshing state... [id=r-rtb-0996922b3d691f5321080289494]
module.vpc.aws_route_table_association.main_public: Refreshing state... [id=rtbassoc-0c7042658650cd935]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_prometheus_ingress_rule: Refreshing state... [id=sgr-05aaed88b884555e5]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_ssh_ingress_rule: Refreshing state... [id=sgr-0b5493b8602b32ce3]
module.vpc.aws_vpc_security_group_ingress_rule.main_http_ingress_rule: Refreshing state... [id=sgr-0fca44cfd92afec79]
module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_node_exporter_ingress_rule: Refreshing state... [id=sgr-0ed166f2e5fc12fbd]
module.vpc.aws_vpc_security_group_egress_rule.main_allow_all_traffic_egress_rule: Refreshing state... [id=sgr-04b94722415e79eb5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ etag                        = "W/\"479b90d57fa641d77760ca67b28de78448bd59371fe8139ffbaa8d8c2e11ef63\"" -> "W/\"12d8670c99009364764b08e2d89d2d5e1c96f85d99d9604cfb7115798309a50a\""
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.server will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-0e1bed4f06a3b463d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "server-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-07545b1673838832f"
      + tags                                 = {
          + "Managedby" = "Terraform"
          + "Name"      = "server"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all                             = {
          + "Managedby" = "Terraform"
          + "Name"      = "server"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ccf337d8d9573956ff8d3f1c22c48b79215e4873"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-02a0a6a3f1dd78a9b",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/sda1"
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = {
              + "Managedby" = "Terraform"
              + "Name"      = "server"
              + "Owner"     = "Thandi"
              + "Project"   = "Server"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ public_instance_ip = "18.208.163.131" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform Plan*